MMBytes/MultiGeiger-V2/sdkconfig.defaults.feathers3_d
# ============================================================================
# Unexpected Maker FeatherS3-D overlay — ESP32-S3, 16 MB flash, 8 MB QSPI
# PSRAM, native USB-C (no CP2102).
# ============================================================================

CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash on FeatherS3-D.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# QSPI PSRAM at 80 MHz. Quad mode per the product page; flip to
# CONFIG_SPIRAM_MODE_OCT=y if a future revision uses octal-mode silicon
# (the XIAO ESP32-S3 overlay does exactly this — same chip, different
# PSRAM interface). Verified once chip-info boot line reports the package.
# NOTE: IDF v6.0 renamed this symbol from SPIRAM_MODE_OCTAL → MODE_OCT.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=40960

# --- V2.5.33: route the fragmenting network/TLS allocations to PSRAM ----------
# Root-cause fix for the INTERNAL-DRAM fragmentation that armed the heap-guard
# auto-reboot (esp32-5965048: INTERNAL largest-free 68K->39K when an inbound
# /config plus the per-cycle outbound TLS POSTs churn small buffers in the tiny
# internal arena). Both consumers now allocate from the multi-MB PSRAM, so the
# internal arena stays defragmented:
#   * WiFi + lwIP pbufs/PCBs -> PSRAM (the bisecting allocator we traced)
#   * mbedTLS record/session -> PSRAM (the big per-cycle internal churn)
# ALWAYSINTERNAL lowered 16384 -> 4096 so medium app buffers spill too. DMA- and
# IRAM-required allocations still pass MALLOC_CAP_DMA/INTERNAL and stay internal,
# and RESERVE_INTERNAL=40960 guarantees internal headroom for them.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Console / flashing path: USB-Serial-JTAG (S3 built-in, no TinyUSB needed).
# `printf` and `ESP_LOGx` go to USB-C; `idf.py flash` uses the same port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# UART0 still routed but secondary — leave RX/TX (IO44/IO43) free for
# external probing; firmware does not use them as a console.
